config/cf/Catalogs/СтатусыКарточекНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СтатусыКарточекНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Catalogs/СтатусыКарточекНоменклатуры/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Картинка.Получить() = Неопределено Тогда 
		Картинка = Новый ХранилищеЗначения(БиблиотекаКартинок.вмхКартинкаНеВыбранногоВидаСклада);
	КонецЕсли;	
	
	Если ЭтоНовый() Тогда
		НоваяСсылка = Справочники.СтатусыКарточекНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор);
		УстановитьСсылкуНового(НоваяСсылка);
	Иначе
		НоваяСсылка = Ссылка;
	КонецЕсли;
	
	НавСсылка = ПолучитьНавигационнуюСсылку(НоваяСсылка, "Картинка");

КонецПроцедуры

#КонецОбласти

#КонецЕсли
